// Problem-01: New Price for Eid Sale
// ⚠️ Function Name Must be newPrice()

// আসন্ন ইদ উপলক্ষে তুমি তোমার দোকানের প্রোডাক্টে ডিসকাউন্ট দিতে চাচ্ছ। কিন্তু প্রতিটা প্রোডাক্টের নতুন দাম আলাদা আলাদা হিসাব করতে গেলে ঝামেলা। তাই তুমি একটা ফাংশন বানাতে চাও, যা মূল দাম এবং ডিসকাউন্ট% নিলে নতুন দাম বের করে দেবে।

// 📥 Input:
// প্রথম ইনপুট: একটি সংখ্যা যা মূল দাম
// (currentPrice : Number)
// দ্বিতীয় ইনপুট: একটি সংখ্যা যা ডিসকাউন্ট
// (discount : Number %)
// 🚀 Output:
// ফাংশনটি ডিসকাউন্ট করে নতুন দাম return করবে (return type string হতে পারে!)
// Output দশমিক সংখ্যা ও হতে পারে
// দশমিক এর পর ৩ ঘর দেখাতে হবে
// 🚩 Challenge:
// যদি

// কোনো ইনপুট সংখ্যা না হয়
// অথবা discount এর পরিমান যদি 0 এর থেকে কম এবং 100 এর চেয়ে বেশি হয়
// তাহলে "Invalid" string রিটার্ন করবে

// 💡 Hints:
// যদি
// currentPrice = 1500 এবং discount = 20 হয়

// Discount = (1500 * 20) / 100 = 300
// New Price = 1200



function newPrice(currentPrice, discount) {
    let Discount = (currentPrice * discount) / 100; 
    const newPrice = currentPrice - Discount;
    if(typeof discount !== "number" || typeof currentPrice !== "number" || discount <  0 || discount > 100 ){
        return "Invalid";
    }
    else{
        const fixPrice = newPrice.toFixed(3);
        // const toInter = Number(Number(newPrice).toFixed(3)); //try to price return a integer number but i am failed
        return fixPrice;
    }

}
const Price = newPrice(1500,10);
console.log(Price);